# 1. Explain the dataset

In [41]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from scipy import stats
from statsmodels.stats import weightstats as stests

In [42]:
dataset=pd.read_csv("Advertising.csv")
dataset.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

In [43]:
dataset.shape

(200, 5)

In [44]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  200 non-null    int64
 1   TV          200 non-null    float64
 2   Radio       200 non-null    float64
 3   Newspaper   200 non-null    float64
 4   Sales       200 non-null    float64
dtypes: float64(4), int64(1)
memory usage: 7.9 KB

## *Observation:The details of data can be found from the above*

# 2.Check the summary statistics and discuss the max, min, avg, median,and percentiles.

In [45]:
data1=dataset.drop(['Unnamed: 0','Sales'],axis=1)
data1.describe()

               TV       Radio   Newspaper
count  200.000000  200.000000  200.000000
mean   147.042500   23.264000   30.554000
std     85.854236   14.846809   21.778621
min      0.700000    0.000000    0.300000
25%     74.375000    9.975000   12.750000
50%    149.750000   22.900000   25.750000
75%    218.825000   36.525000   45.100000
max    296.400000   49.600000  114.000000

In [46]:
data1.shape

(200, 3)

# 3.The manager wants to find out whether the same amount was spent for the three advertisements (TV , Radio and Newspaper). Comment on your findings.

### Ho:Same mean amount was spent for the three advertisements (TV , Radio and Newspaper)

### Ha: Mean amount spent for the three advertisements (TV , Radio and Newspaper) are different

In [47]:
alpha=0.05
dfn=3-1;
dfd=200-1
critical_value=stats.f.ppf(alpha, dfn, dfd)

In [48]:
data1.columns

Index(['TV', 'Radio', 'Newspaper'], dtype='object')

In [49]:
statistic,pvalue=stats.f_oneway(data1['TV'],data1['Radio'],data1['Newspaper'])
if pvalue<alpha:
    print('We Reject Null Hypothesis(Ho); Mean amount spent for the three advertisements (TV , Radio and Newspaper) are different¶')
else:
    print('Same mean amount was spent for the three advertisements (TV , Radio and Newspaper)')

We Reject Null Hypothesis(Ho); Mean amount spent for the three advertisements (TV , Radio and Newspaper) are different¶

In [50]:
print('F-statistics computed:',statistic)
print('critical_value computed:',critical_value)

F-statistics computed: 358.8514595342597
critical_value computed: 0.05130651777554282

In [51]:
print('significance level:',alpha)
print('P_Value:',pvalue)

significance level: 0.05
P_Value: 4.552931539744962e-103

## <i><u>Observation:</u> Mean amount spent for the three advertisements (TV , Radio and Newspaper) are different</i>

In [52]:
Stream_wise=pd.DataFrame(data1.sum(axis=0,skipna = True))
Stream_wise

                 0
TV         29408.5
Radio       4652.8
Newspaper   6110.8